Revit 2027 API
BuiltInFailures.SplineFailures.CannotCreateSpline Property
 Can't make Spline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateSpline { get; }
Public Shared ReadOnly Property CannotCreateSpline As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateSpline {
	FailureDefinitionId^ get ();
}
static member CannotCreateSpline : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SplineFailures Class
Autodesk.Revit.DB Namespace